Revit 2024 API
FormulaEditingEventArgs.ParameterId Property
 Returns the Id of the modified parameter
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElementId ParameterId { get; }
Visual Basic
Public ReadOnly Property ParameterId As ElementId
	Get
Visual C++
public:
property ElementId^ ParameterId {
	ElementId^ get ();
}
See Also
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace